# 1
# Debugging ნიშნავს კოდში შეცდომების (bug-ების) პოვნასა და გასწორებას.
# მისი მიზანია პროგრამა სწორად და შეცდომების გარეშე იმუშაოს.

# 2
name = 13
name = 14
print(name)

# 3 
water = "butter"
melon = "fly" 
result = water + melon 
print(result)

# 4
print(4564 % 4)  # ზუსტად იყოფა  და 1141 ია
print(9768 % 3)  # ესეც ზუსტად იყოფა და 3256 ია
print(16785 % 3)   #არც ამას არ აქვს ნაშთი და 5595 ია

# 5
# სწორია 
name = "saba"
name = "giorgi"
print(name)  # შეცდომა ის იყო რომ Name ში N დიდი ასოტი არ უნდა წერებოდა

num = 40
print(num * 3) # შეცდომა ისაა რომ სტრინგი სტრინგზე ვერ გამრავლდება