 # 1)კონკატინაცია არის ორი ან მეტი სტრინგის ერთმანეთთან შეერთება.
 # 2)
name = "giorgi"
age = "14"
students = "True"
# 3)
print(5 + 3)   # 8  - მიმატება
print(5 - 3)   # 2  - გამოკლება
print(5 * 3)   # 15 - გამრავლება
print(5 / 3)   # 1.(6) - გაყოფა 
print(5 ** 3)  # 125 - ხარისხში აყვანა

# 4)
print("  giorgi" * 20)

# 5)  "homework" + 5 გამოიწვევს ერორს, რადგან Python-ში სტრინგს და რიცხვს ვერ ამატებ.
# ეს ორი განსხვავებული ტიპია (string + int) და პროგრამა ვერ ხვდება როგორ უნდა დაამატოს ისინი.

# 6)
name = "student"
print(name + name)
# გამოიტანს: studentstudent

number = 23
number1 = "4"
print(number + number1)
# გამოიწვევს ერორს, რადგან int და string ვერ ემატება ერთმანეთს.

# 7) საკლასო დავალება მაშინვე დავასრულე

