# 1
# Algorithm არის ნაბიჯ-ნაბიჯ ინსტრუქციების თანმიმდევრობა,
# რომელიც პრობლემის გადაჭრას ემსახურება (მაგ: რა ნაბიჯებით გამოვაცხოთ ნამცხვარი)
# Control Flow ნიშნავს როგორ და რა რიგით სრულდება კოდი
# ანუ პროგრამა წყვეტს, რომელი ნაწილი შესრულდეს

# 2
# % აბრუნებს გაყოფის შედეგად დარჩენილ ნაშთს

print(10 % 3)   # 1
print(17 % 2)   # 1
# // აბრუნებს გაყოფის მხოლოდ მთელ ნაწილს

print(10 // 3)  # 3
print(17 // 2)  # 8

# 3
age = 14
name = "giorgi"
print(age > 15 and name == "giorgi")

# 4
age = int(input("შეიყვანე ასაკი: "))
name = input("შეიყვანე სახელი: ")
print(age >18 or name=="Andrew")

# 5

num = 17
print(num > 18 or 2 > 1) #true 

# age = 18
# print(Age >= 18 and 10==10)
# error რადგან ცვლადში დიდი a პატარაა ხოლო კოდში დიდი A

random = "saba"
print("saba" == random or 17 % 2 == 0) #true